"""3.6 Задания на циклы =======================================
Задание 7 (Задания на рекуррентные сотношения) Задания выполняйте все по порядку.
Придумайте рекуррентное соотношение, задающее следующие числовые последовательности:
a) 1, 2, 3, 4, . . .
b) 0, 5, 10, 15, . . .
c) 1, 1, 1, 1, . . .
d) 1, −1, 1, −1, . . .
e) 1, −2, 3, −4, 5, −6 . . .
f) 2, 4, 8, 16, . . .
g) 2, 4, 16, 256, . . .
h) 0, 1, 2, 3, 0, 1, 2, 3, 0, . . .
i) 1!, 3!, 5!, 7!, . . ."""

# print(
#     [i for i in range(1, 11)], # a
#     [i for i in range(0, 50, 5)], # b
#     [1 for _ in range(1, 11)], # c
#     [(1 if i % 2 != 0 else -1) for i in range(1, 11)], # d
#     [(i if i % 2 != 0 else -i) for i in range(1, 11)], # e
#     [i for i in range(2, 20, 2)], # f
#     [2] + [2**i for i in range(2, 16, 2)], # g
#     [0, 1, 2, 3] * 3, # h
#     [str(i) + '!' for i in range(1, 16, 2)], # i
#     sep='\n'
# )