"""Задание 27 Выполнять одно задание с номером (𝑛 − 1)%𝑚 + 1, где 𝑛 —
номер в списке группы, а 𝑚 — число задач в задании."""

# n = 19 # по прежнему Михайлов
# m = 3 # кол-во. заданий
# print((n - 1) % m + 1) # =1

"""Сгенерируйте случайные векторы из 10, 30 и 200 значений:
3. из целых чисел в диапазоне [0; 10]."""

# import numpy as np

# # Вектор из 10 значений
# vector_10 = np.random.randint(0, 11, size=10)

# # Вектор из 30 значений
# vector_30 = np.random.randint(0, 11, size=30)

# # Вектор из 200 значений
# vector_200 = np.random.randint(0, 11, size=200)

# # Вывод векторов
# print("Вектор из 10 значений:", vector_10)
# print("Вектор из 30 значений:", vector_30)
# print("Вектор из 200 значений:", vector_200)